sdaiCreateNestedAggr(Sdai_Id_aggr*)
\details
Creates a nested aggregate in a specified aggregate.
\param aggregate [in] An aggregate that should contain the newly created aggregate.
\returns The created SDAI aggregate object.